#!/usr/bin/env runghc
-- coding: utf-8

{-
#######################################################
#######################################################
#######################################################
#
#
# はじめての Haskell プログラミング
#
#
#######################################################
#######################################################
#######################################################
-}



import System.IO
import Data.Char(toUpper)

{-
#######################################################
# input.txt から読み込んだ内容を大文字に変換し、
# output.txt に書きだします。
#######################################################
-}

main = do

	inh <- openFile "input.txt" ReadMode
	outh <- openFile "output.txt" WriteMode
	line <- hGetContents inh
	hPutStr outh (map toUpper line)
	hClose inh
	hClose outh
